Update Readme and favicon
